Autodesk.Revit.DB.Electrical.ElectricalSetting.IsValidSpecificFittingAngle(System.Double)
Checks that the given value is a valid specific fitting angle. The specific fitting angles are angles of 90, 60, 45, 30, 22.5 or 11.25 degrees.
angle:
The angle value (in degree).
Returns:
True if the given value is a valid specific fitting angle.
Since:
2014

Autodesk.Revit.DB.Electrical.ElectricalSetting.GetSpecificFittingAngleStatus(System.Double)
Gets the status of given specific fitting angle.
angle:
The specific fitting angle (in degree) that must be one of 90, 60, 45, 30, 22.5 or 11.25 degrees.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for angle must be 90, 60, 45, 30, 22.5 or 11.25 degrees.
Since:
2014

Autodesk.Revit.DB.Electrical.ElectricalSetting.SetSpecificFittingAngleStatus(System.Double,System.Boolean)
Sets the status of given specific angle.
angle:
The specific angle (in degree) that must be 60, 45, 30, 22.5 or 11.25 degrees.
bStatus:
Status, true - using the given angle during the pipe layout.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for angle must be 90, 60, 45, 30, 22.5 or 11.25 degrees.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Can not set an angle status for an invalid angle.
Since:
2014

Autodesk.Revit.DB.Electrical.ElectricalSetting.GetSpecificFittingAngles
Gets the list of specific fitting angles.
Remarks:
Revit will only use the angles specified during the cable tray or conduit layout or modifying the layout.
When laying out the cable tray or conduit, if the angle between two cable trays or conduits is close to the allowed angle,
The specific angle is used for that cable tray or conduit fitting.
Returns:
Angles (in degrees).
Since:
2014

Autodesk.Revit.DB.Electrical.ElectricalSetting.GetElectricalSettings(Autodesk.Revit.DB.Document)
Get the electrical settings of the project.
document:
The document.
Returns:
The electrical settings of the project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Electrical.ElectricalSetting.CircuitSequence
The sequence in which power circuits are created.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015 Subscription Update

Autodesk.Revit.DB.Electrical.ElectricalSetting.CircuitLoadCalculationMethod
The method to calculate circuit load
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2017

Autodesk.Revit.DB.Electrical.ElectricalSetting.CircuitPathOffset
The default circuit path offset for newly created circuit.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSetting.CircuitRating
The default circuit rating for newly created circuit.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The circuit rating should be non-negative.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalSetting.CircuitNamePhaseC
Circuit Naming by Phase - Phase C Label.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2015 Subscription Update

Autodesk.Revit.DB.Electrical.ElectricalSetting.CircuitNamePhaseB
Circuit Naming by Phase - Phase B Label.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2015 Subscription Update

Autodesk.Revit.DB.Electrical.ElectricalSetting.CircuitNamePhaseA
Circuit Naming by Phase - Phase A Label.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2015 Subscription Update

Autodesk.Revit.DB.Electrical.ElectricalSetting.RemoveWireType(Autodesk.Revit.DB.Electrical.WireType)
Remove wire type definition from project.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Wire type can be removed only if it is not used, otherwise an exception will be thrown.

Autodesk.Revit.DB.Electrical.ElectricalSetting.AddWireType(System.String,Autodesk.Revit.DB.Electrical.WireMaterialType,Autodesk.Revit.DB.Electrical.TemperatureRatingType,Autodesk.Revit.DB.Electrical.InsulationType,Autodesk.Revit.DB.Electrical.WireSize,System.Double,System.Boolean,Autodesk.Revit.DB.Electrical.NeutralMode,Autodesk.Revit.DB.Electrical.WireConduitType)
Add a new wire type to project.
name: Name of the new wire type.
materialType: Wire material of new wire type.
temperatureRating: Temperature rating type information of new wire type.
insulation: Insulation of new wire type.
maxSize: Max wire size of new wire type.
neutralMultiplier: Neutral multiplier of new wire type.
neutralRequired: Specify whether neutral point is required.
neutralMode: Specify neutral mode.
conduit: Conduit type of new wire type.
Returns: New added wire type object.
Remarks: Parameter of temperatureRating should be retrieved from parameter of materialType,
and parameters such as insulation and maxSize should be retrieved from temperatureRating.
otherwise, this add operation is most likely to fail.

Autodesk.Revit.DB.Electrical.ElectricalSetting.RemoveWireMaterialType(Autodesk.Revit.DB.Electrical.WireMaterialType)
Remove the wire material type from project.
materialType: The wire material type to be removed.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Wire material type can be removed only if it is not currently assigned to any wire type,
and the last one wire material type can't be removed, otherwise an exception will be thrown.

Autodesk.Revit.DB.Electrical.ElectricalSetting.AddWireMaterialType(System.String,Autodesk.Revit.DB.Electrical.WireMaterialType)
Add a new type of wire material.
name: Name of new material type.
baseMaterial: Specify an existing material type which New material will be constructed based on.
Returns: New added wire material type object.

Autodesk.Revit.DB.Electrical.ElectricalSetting.RemoveDistributionSysType(Autodesk.Revit.DB.Electrical.DistributionSysType)
Remove an existing distribution system type from the project.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Distribution system type can be removed only if it is not currently assigned to any devices, otherwise an exception will be thrown.

Autodesk.Revit.DB.Electrical.ElectricalSetting.AddDistributionSysType(System.String,Autodesk.Revit.DB.Electrical.ElectricalPhase,Autodesk.Revit.DB.Electrical.ElectricalPhaseConfiguration,System.Int32,Autodesk.Revit.DB.Electrical.VoltageType,Autodesk.Revit.DB.Electrical.VoltageType)
Add a new distribution system type to project.
name: The name of new added distribution system type
phase: Single or three phase this type is
phaseConfig: Configuration property of given phase
numWire: Wire number of this distribution system
volLineToLine: Type of line to line voltage in this system
volLineToGround: Type of line to ground voltage in this system
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name can't be null, empty string, or equal with any existing one,
phaseConfig should be defined and numWire can only be 3 or 4 in case of three phase,
numWire can only be 2 or 3 in case of single phase,
otherwise exception will be thrown.
Returns: New added distribution system type object.

Autodesk.Revit.DB.Electrical.ElectricalSetting.RemoveVoltageType(Autodesk.Revit.DB.Electrical.VoltageType)
Remove the voltage type from project.
voltageType: Specify the voltage type to be removed.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Voltage type can be removed only if it isn't in service with any distribution systems.

Autodesk.Revit.DB.Electrical.ElectricalSetting.AddVoltageType(System.String,System.Double,System.Double,System.Double)
Add a new type definition of voltage into project.
name: Specify voltage type name
actualValue: Specify actual value of voltage type.
minValue: Specify acceptable minimum value of the voltage type.
maxValue: Specify acceptable maximum value of the voltage type.
Returns: New added voltage type object.

Autodesk.Revit.DB.Electrical.ElectricalSetting.WireConduitTypes
Get electrical conduit types information of the project.

Autodesk.Revit.DB.Electrical.ElectricalSetting.WireMaterialTypes
Get electrical wire material types information of the project.

Autodesk.Revit.DB.Electrical.ElectricalSetting.DistributionSysTypes
Get all distribution system types of the project.

Autodesk.Revit.DB.Electrical.ElectricalSetting.WireTypes
Get all wire type definition information of the project.

Autodesk.Revit.DB.Electrical.ElectricalSetting.VoltageTypes
Get all voltage type definitions information of the project.

Autodesk.Revit.DB.Electrical.ElectricalSetting
The ElectricalSetting class represents an instance of element of electrical settings.
Since:
2011